Revit 2026 API

# InterferenceFailures Properties

---

The BuiltInFailuresInterferenceFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GeometryWarning | A geometrical error has occurred while checking for Interference. Reported interference may not be accurate. |

#### Reference

BuiltInFailuresInterferenceFailures Class

Autodesk.Revit.DB Namespace